src/toir_cfe/src/DataProcessors/проф_ПечатьАктПодготовкиКЗимнейЭксплуатации/проф_ПечатьАктПодготовкиКЗимнейЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ПечатьАктПодготовкиКЗимнейЭксплуатации</name>
</mdclass:DataProcessor>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad62bbb-21aa-4934-a430-a1bd6aa95383">
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/DataProcessors/проф_ПечатьАктПодготовкиКЗимнейЭксплуатации/ObjectModule.bsl
//++ Проф-ИТ, #78, Башинская А., 13.10.2023	

#Область ПрограммныйИнтерфейс

Функция ПечатьАктПодготовкиКЗимнейЭксплуатации(МассивОбъектов, ПараметрыПечати) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("проф_АктПодготовкиКЗимнейЭксплуатации");
	
	ОбластьШапкаКомплектующие = Макет.ПолучитьОбласть("ОбластьШапкаКомплектующие");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапросаПечатьАктПодготовкиКЗимнейЭксплуатации(); 
	
	ОбщаяВыборка = Запрос.ВыполнитьПакет(); 
	ТЗОР = ОбщаяВыборка[0].Выбрать(); 
	ВыборкаРемонтныеРаботы = ОбщаяВыборка[1].Выбрать();  
	ВыборкаМатериальныеЗатраты = ОбщаяВыборка[2].Выбрать(); 
	ВыборкаСерийныеЗапчасти = ОбщаяВыборка[3].Выбрать();
	
	Для Каждого СсылкаНаОбъект Из МассивОбъектов Цикл  
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СсылкаНаОбъект);				
		Пока ТЗОР.НайтиСледующий(Отбор) Цикл
			
			ОбластьШапки   = Макет.ПолучитьОбласть("ОбластьШапка");
			ОбластьШапки.Параметры.ОбъектРемонта = ТЗОР.ОбъектРемонта;
			ТабДок.Вывести(ОбластьШапки);
			
			Отбор.Вставить("ID", ТЗОР.ID);
			
			ВывестиРемонтныеРаботы(ВыборкаРемонтныеРаботы, Отбор, ТабДок, Макет);
									
			ТабДок.Вывести(ОбластьШапкаКомплектующие);
			
			ВывестиМатериальныеЗатраты(ВыборкаМатериальныеЗатраты, Отбор, ТабДок, Макет);
			
			ВывестиСерийныеЗапчасти(ВыборкаСерийныеЗапчасти, Отбор, ТабДок, Макет);
						
			ТабДок.Вывести(ОбластьПодвал); 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		ТЗОР.Сбросить();
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПечатьАктПодготовкиКЗимнейЭксплуатации()
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID КАК ID,
		|	ПРЕДСТАВЛЕНИЕ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) КАК РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено КАК Выполнено
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID КАК ID,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #78
		|	СпрНоменклатура.Код КАК КодНоменклатуры,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #78
		|	ЕСТЬNULL(СпрНоменклатура.Артикул, """") КАК Артикул,
		|	ЕСТЬNULL(СпрНоменклатура.Наименование, """") КАК Наименование,
		|	ПРЕДСТАВЛЕНИЕ(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество КАК Количество,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка КАК Ссылка,
//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #78
		|	СпрНоменклатура.Код КАК КодНоменклатуры,
//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #78
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.РемонтыОборудования_ID КАК ID,
		|	ЕСТЬNULL(СпрНоменклатура.Артикул, """") КАК Артикул,
		|	ЕСТЬNULL(СпрНоменклатура.Наименование, """") КАК Наименование,
		|	ПРЕДСТАВЛЕНИЕ(торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ХарактеристикаНоменклатурыНовая) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.КоличествоНовое КАК Количество
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.СерийныеЗапчасти КАК торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ВывестиРемонтныеРаботы(ВыборкаРемонтныеРаботы, Отбор, ТабДок, Макет)

	Пока ВыборкаРемонтныеРаботы.НайтиСледующий(Отбор) Цикл 
		ОбластьСтрокаРодитель  = Макет.ПолучитьОбласть("ОбластьСтрокаРодитель"); 
		ОбластьСтрокаРабота  = Макет.ПолучитьОбласть("ОбластьСтрокаРабота"); 	
		Если ЗначениеЗаполнено(ВыборкаРемонтныеРаботы.Родитель_ID) Тогда 
			ОбластьСтрокаРабота.Параметры.Работа = ВыборкаРемонтныеРаботы.РемонтнаяРабота;
			ОбластьСтрокаРабота.Параметры.Выполнено = ?(ВыборкаРемонтныеРаботы.Выполнено = Истина, "b", "");
			ТабДок.Вывести(ОбластьСтрокаРабота); 
		Иначе
			ОбластьСтрокаРодитель.Параметры.Родитель = ВыборкаРемонтныеРаботы.РемонтнаяРабота;
			ТабДок.Вывести(ОбластьСтрокаРодитель);
		КонецЕсли;	
	КонецЦикла;	
	ВыборкаРемонтныеРаботы.Сбросить();		
	
КонецПроцедуры	

Процедура ВывестиМатериальныеЗатраты(ВыборкаМатериальныеЗатраты, Отбор, ТабДок, Макет)
	
	Пока ВыборкаМатериальныеЗатраты.НайтиСледующий(Отбор) Цикл
		ОбластьСтрокаКомплектующие = Макет.ПолучитьОбласть("ОбластьСтрокаКомплектующие");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаКомплектующие.Параметры, ВыборкаМатериальныеЗатраты);
		ТабДок.Вывести(ОбластьСтрокаКомплектующие);
	КонецЦикла;
	ВыборкаМатериальныеЗатраты.Сбросить();	
	
КонецПроцедуры	

Процедура ВывестиСерийныеЗапчасти(ВыборкаСерийныеЗапчасти, Отбор, ТабДок, Макет)
	
	Пока ВыборкаСерийныеЗапчасти.НайтиСледующий(Отбор) Цикл
		ОбластьСтрокаКомплектующие = Макет.ПолучитьОбласть("ОбластьСтрокаКомплектующие");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаКомплектующие.Параметры, ВыборкаСерийныеЗапчасти);
		ТабДок.Вывести(ОбластьСтрокаКомплектующие);
	КонецЦикла;
	ВыборкаСерийныеЗапчасти.Сбросить();	
	
КонецПроцедуры	

#КонецОбласти

//-- Проф-ИТ, #78, Башинская А., 13.10.2023
